dynamicKEqn/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 61.644; //14.855

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 61.644;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            epsilonWallFunction;
        value           uniform 61.644;
    }
    wall2
    {
        type            epsilonWallFunction;
        value           uniform 61.644;
    }
    wall3
    {
        type            epsilonWallFunction;
        value           uniform 61.644;
    }
    wall4
    {
        type            epsilonWallFunction;
        value           uniform 61.644;
    }
    wall5
    {
        type            epsilonWallFunction;
        value           uniform 61.644;
    }
   frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type           symmetry;
    }
}


// ************************************************************************* //
