dynamicKEqn/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.03335;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.03335;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            fixedValue;
        value           uniform 0;
    }
     wall2
    {
        type            fixedValue;
        value           uniform 0;
    }
     wall3
    {
        type            fixedValue;
        value           uniform 0;
    }
     wall4
    {
        type            fixedValue;
        value           uniform 0;
    }
     wall5
    {
        type            fixedValue;
        value           uniform 0;
    }
    
   
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type           symmetry;
    }
}


// ************************************************************************* //
