dynamicKEqn/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          1e-6;
        smoother        GaussSeidel;
        preconditioner  DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0;
        smoother        GaussSeidel;
        preconditioner  DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|nuTilda|nuSgs)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          1e-3;
    }

    "(UFinal|kFinal|epsilonFinal|nuTildaFinal|nuSgsFinal)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    epsilon
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.1;
    }
}

PIMPLE
{
    nCorrectors             2;
    nNonOrthogonalCorrectors 0;
    pRefCell                0;
    pRefValue               0;

    residualControl
    {
        p           1e-2;
        U           1e-3;
        "(k|epsilon|nuTilda|nuSgs)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p           0.2;
    }
    equations
    {
        U           0.3;
        k           0.3;
        epsilon     0.3;
        nuTilda     0.3;
        nuSgs       0.3;
    }
}

// ************************************************************************* //

